import random
import sys
import time

import self


# -*- coding: utf-8 -*-


class Player:
    def __init__(self):
        self.health = 100
        self.power = 20



print("Вітаю, шукачу пригод! Як тебе звуть?")
input("Введіть ім'я: ")
print("Що ж, дуже приємно(ні)! Я оповідач. Я буду супроводжувати тебе до кінця твоєї подорожі!")
print("Ну, почнімо.")



вибір=input("Надрукуйте 'Так' або 'Ні': ")
while True:
    if вибір.lower() == "так":
        print("Гра розпочалася!")
        break
    elif вибір.lower()=="ні":
        print("Ну то вали звідси")
        sys.exit()
print("Ти, славетний герой, маєш знайти давно втрачений артефакт.")
print("Він знаходиться у печері, до якої шлях не близький. Буть готовим, що на шляху тобі попадатимуться небезпеки.")
print( "Ще раз питаю, чи ти готовий?")



вибір2=input("Так чи ні? ")
while True:
    if вибір2.lower()=="так":
         print("Вперед на зустріч пригодам!")
         break
    elif вибір2.lower()=="ні":
         print("Отже, ти боягуз. Ну добре, забирайся звідси і не повертайся!")
         sys.exit()


print(f"Головний герой йде полями \nйде \nйде \nйде... \nКапець як довго йде...")

print("Аж раптом!")

time.sleep(3)

print("Жартую, нічого не відбувається. Герой й далі йде...")

time.sleep(5)

print("Герой продоавжує йти... *Історія настільки цікава, що Оповідач заснув*")

time.sleep(1)

print("*Асистент старається його якось розбудити... Не виходить. Асистент вирішує щось добавити в історії...*")

time.sleep(5)


print("НА ГЕРОЯ НАПАВ РОЗБІЙНИК!!!*Оповідач аж підірвався від крику*")
print("Отже, тобі треба якось перемогти розбійника, інакше він тебе вб'є або пограбує.")
print("Що правда, в тебе нічого краси, бо ти бомж, тому він тебе просто вб'є")
attack=input("Ти можеш відбиватися від противника, чи бажаєш нанести удар? (відповідь тільки 'так' бо 'ні'): ")
while True:
    if attack.lower() =="так":
        print("Ти наніс урон в 20 одиниць")
        print("Перемога! Противник вийшов у лоббі, тобто здох")
        break
    elif attack.lower()=="ні":
        print("Противник наносить удар")
        a=random.randint(1,50)
        print(f"Розбійник зніс тобі {a} одиниць здоров'я")
        break
        if self.health==0:
            print("Ти героїчно здох")
            sys.exit()



print("Що ж, небезпека минула, Оповідач не спить. Головний герой продовжує шлях.")

time.sleep(4)

print("Через ще деякий час персонаж натрапив на дрімучий ліс, який не можливо обійти. Тільки пройти його наскрізь")

choice=input("Чи бажаєш ти пройти скрізь ліс? Адже хто зна що там може бути. 'так' чи 'ні'?: ")
while True:
    if choice.lower()=="так":
        print("Головний герой сміливо зайшов у дрімучий ліс")
        break
    elif choice.lower()=="ні":
        print("То навіщо було це все? Тепер повертайся сам, клятий боягуз!")
        sys.exit()
print("Отже, персонаж продовжив свій шлях. Тепер вже через ліс")
time.sleep(3)
print("З кожним кроком він ставав все густішим і густішим. Небо все гірше і гірше проглядалось крізь гілля дерев")
time.sleep(5)
print("Аж раптом головний герой натрапив на...")
time.sleep(5)
print("В Оповідача закінчилась фантазія, тому потрібно почекати доки він щось ще придумає... Можливо, колись... ")

